app/views/comments/_comment.html.erb

	<p>
		<%= comment.user.first_name %>  <small><em><%= "#{time_ago_in_words(comment.created_at)} ago" %></em></small>
---
INSERT INTO "comments" ("user_id", "body", "rating", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 3], ["body", "Try this again"], ["rating", 5], ["product_id", 27], ["created_at", 2017-05-30 13:51:13 UTC], ["updated_at", 2017-05-30 13:51:13 UTC]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]