app/controllers/comments_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "body", "rating", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["body", "required"], ["rating", 4], ["product_id", 27], ["created_at", 2017-05-19 23:26:16 UTC], ["updated_at", 2017-05-19 23:26:16 UTC]]
---
	def create
		@product = Product.find(params[:product_id])
		@comment = @product.comments.new(comment_params)
		@comment.user = current_user
		respond_to do |format|
      if @comment.save