app/controllers/payments_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
INSERT INTO "orders" DEFAULT VALUES
---
	def create
		@product = Product.find(params[:product_id])
		@user = current_user
		token = params[:stripeToken]
		#create the charge on STripe's servers - this will charge the user's card
		begin
			charge = Stripe::Charge.create(
				amount: (@product.price * 100), #amount in cents, again
				currency: "usd",
				source: token,
				description: params[:stripeEmail],
				)
		if charge.paid
			Order.create(product_id: @product_id, user_id: @user_id, total: @product_price)