app/controllers/products_controller.rb

  def index
    if params[:q]
      search_term = params[:q]
      @products = Product.search(search_term)
---
SELECT "products".* FROM "products" WHERE (name LIKE '%mountain%')
SELECT MAX("products"."updated_at") FROM "products"

  def show
    @comments = @product.comments.paginate(page: params[:page], per_page: 5)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."product_id" = ? LIMIT ? OFFSET ?  [["product_id", 27], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 27]]

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at", "color") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Bike No. 1"], ["description", "Bike Number One"], ["image_url", "TBD"], ["created_at", 2017-04-10 00:41:57 UTC], ["updated_at", 2017-04-10 00:41:57 UTC], ["color", "Black"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "colour" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["colour", ""], ["updated_at", 2017-05-23 15:57:12 UTC], ["id", 27]]