app/controllers/static_pages_controller.rb

  def landing_page
  	@featured_product = Product.first
---
SELECT  "products".* FROM "products" ORDER BY "products"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 1]]